'use strict';

const Code = {
    "10002": "form校验出错!",

    //模块(000)  + 分层(0: controller, 1: service, 2: form) + 文件(00) + 错误码(000)

    //订单
    '101101001': '订单创建失败',
    '101101002': '订单不存在',
    '101101004': '支付打包失败',
    '101101005': '已选支付方式，不可切换',
    '101101006': '未开启分笔策略，请检查',
    '101101007': '参数分笔数量超过设置',
    '101101008': '支付金额不匹配',
    '101101009': '订单已经支付完成',
    '101101010': '不要发起重复的支付完成申请',
    '101101011': '相关订单详情信息不存在',
    '101101012': '未选择缴费项目',
    '101101013': '参数分笔金额超过设置',
    //学校
    '102101001': '学校创建失败',
    '102101002': '学校更新失败',
    '102101003': '学校获取失败',
    '102101004': '学校查询失败',
    '102101005': '学校不存在',
    '102101006': '学校支付配置获取失败',

    //班级
    '103101001': '班级创建失败',    
    '103101002': '班级更新失败',
    '103101003': '班级获取失败',
    '103101004': '班级查询失败',
    '103101005': '班级不存在',
    '103101006': '班级删除失败',
    '103101007': '班级成员不为空,无法删除',
    '103101008': '换班失败',
    '103101009': '获取年级列表失败',
    '103101010': '获取班级列表失败',
    '103101011': '获取所有班级列表失败',
    '103101012': '班级数据有误',
    '103101013': '班级名称不能重复',

    //学生
    '104101001': '学生创建失败',
    '104101201': '证件号码或学号已重复',
    '104101002': '学生更新失败',
    '104101003': '学生获取失败',
    '104101004': '学生查询失败',
    '104101005': '学生不存在',
    '104101006': '班级删除失败',
    '104101007': '学生录取失败',
    '104101008': '学生导入失败',
    '104101009': '学生导出失败',
    '104101010': '无有效学生数据',
    '104101011': '导入学生必须先选择班级',
    '104101012': '导入班级有误',
    '104101013': '学生数据有误',

    //缴费项目
    '105101001': '缴费项目创建失败',
    '105101101': '缴费项目下发班级失败',
    '105101102': '缴费项目下发学生失败',
    '105101002': '缴费项目更新失败',
    '105101201': '缴费项目更新失败, 解除下发班级失败',
    '105101202': '缴费项目更新失败, 解除下发学生失败',
    '105101003': '缴费项目获取失败',
    '105101004': '缴费项目查询失败',
    '105101005': '缴费项目不存在',
    '105101006': '缴费项目删除失败',
    '105101106': '缴费项目已开始,无法删除',
    '105101007': '结束通知开启后结束通知时间不能为空',
    '105101008': '统计错误',
    '105101009': '状态操作失败',
    '105101010': '缴费项目未开始或已结束',
    '105101011': '此缴费项目未找到相关学生',
    '105101012': '此缴费项目未找到相关用户',
    '105101013': '获取渠道列表失败',
    '105101014': '缴费项目未设置收款类型',
    '105101015': '缴费项目名称不允许重复',

    //集团
    '106101001': '商户信息获取失败',
    '106102001': '商户支付配置获取失败',
    '106103001': '商户创建失败',
    '106103002': '商户更新失败',
    '106103003': '商户获取失败',
    '106103004': '商户查询失败',
    '106103005': '商户不存在',
    '106103006': '重置商户密码失败',
    '106103007': '商户重置状态设置失败',
    '106103008': '商户重置状态-未找到相关后台账号',
    '106103009': '该账号已经存在',

    //商户类型
    '106104001': '商户类型创建失败',
    '106104002': '商户类型更新失败',
    '106104003': '商户类型获取失败',
    '106104004': '商户类型查询失败',
    '106104005': '商户类型不存在',
    '106104006': '商户类型删除失败',
    '106104007': '商户类型重复',
    '106104008': '商户类型已使用，不能删除',

    //商户类型
    '106105001': '收款渠道创建失败',
    '106105002': '收款渠道更新失败',
    '106105003': '收款渠道获取失败',
    '106105004': '收款渠道查询失败',
    '106105005': '收款渠道不存在',
    '106105006': '收款渠道删除失败',

    //事件队列
    '107101001': '添加事件失败',
    '107101002': '批量添加事件失败',

    //缴费项目类型
    '108101001': '缴费项目类型创建失败',
    '108101002': '缴费项目类型更新失败',
    '108101003': '缴费项目类型获取失败',
    '108101004': '缴费项目类型查询失败',
    '108101005': '缴费项目类型不存在',
    '108101006': '缴费项目类型失败',

    //网点
    '109101001': '网点创建失败',
    '109101002': '网点更新失败',
    '109101003': '网点获取失败',
    '109101004': '网点查询失败',
    '109101005': '网点不存在',
    '109101006': '网点创建,学校创建失败',
    '109101007': '网点创建,学校后台用户创建失败',
    '109101008': '网点重置密码失败',
    '109101009': '网点重置状态设置失败',
    '109101010': '网点重置状态-未找到相关后台账号',
    '109101011': '网点重置状态-未找到相关支付配置信息',
    '109101012': '网点创建, 手机号码已存在',

    //模块(000)  + 分层(0: controller, 1: service, 2: form) + 文件(00) + 错误码(000)
    //用户    
    //applet(201)-service(1)-user(02)-code()
    //applet(201)-service(1)-checkCode(04)-code()
    //applet(201)-service(1)-userToStudent(04)-code()
    '201102001': '验证码发送失败',
    '201102002': '手机绑定失败',
    '201102003': '用户不存在',
    '201102004': '手机号码没有获取到',
    '201103001': '验证码创建失败',
    '201103002': '验证码更新失败',
    '201103003': '验证码获取失败',
    '201103004': '验证码查询失败',
    '201103005': '验证码不存在',
    '201103006': '验证码错误',
    '201103007': '请先微信授权',
    '201103008': '请先登录',
    '201103009': '用户信息不存在',

    //家长绑定家长
    '202101001': '学生不存在',
    '202101002': '当前家长已经绑定该学生',
    '202101003': '绑定学生失败',
    '202101004': '查询绑定状态异常',
    '202101005': '创建绑定记录失败',

    '201104001': '该手机号未绑定',
    '201104002': '更换绑定手机失败',
    '201104003': '绑定验证码不正确',
    '201104004': '该手机号已经被其他微信绑定',
};

module.exports = Code
